# Requirements:
# homebrew - http://brew.sh/
# brew file - ttps://raw.github.com/rcmdnk/homebrew-file/
# cask - https://caskroom.github.io/ (installed automatically)

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/services'

brew 'mariadb', restart_service: true

brew 'blackfireio/blackfire/blackfire-agent'
brew 'blackfireio/blackfire/blackfire-php71'

brew 'openldap'
brew 'libiconv'

brew 'imagemagick'
brew 'mas'
brew 'ffmpeg'
brew 'tmux'
brew 'git'
brew 'bash-completion'
brew 'bash-git-prompt'

cask 'google-chrome'
cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'sequel-pro'
cask 'skype'
cask 'iterm2'
cask 'slack'
cask 'postman'
cask 'sourcetree'
cask 'imageoptim'
cask 'visual-studio-code'

mas 'Xcode', id: 497799835
mas 'The Unarchiver', id: 425424353

## Work only Apps
cask 'microsoft-office'
cask 'skype-for-business'
